In [25]:
import pandas as pd
import datetime

df = pd.read_csv('/Users/jkky/Documents/4_2_semester/기계학습기초/기말프로젝트/tide.csv')
df.head()

      Unnamed: 0    0
0  2017.1.1 0:00  268
1  2017.1.1 1:00  192
2  2017.1.1 2:00  132
3  2017.1.1 3:00   89
4  2017.1.1 4:00  176

In [26]:
df.dtypes

Unnamed: 0    object
0              int64
dtype: object

In [27]:
df['Unnamed: 0']

0           2017.1.1 0:00
1           2017.1.1 1:00
2           2017.1.1 2:00
3           2017.1.1 3:00
4           2017.1.1 4:00
               ...
42915    2021.12.31 20:00
42916    2021.12.31 21:00
42917    2021.12.31 22:00
42918    2021.12.31 23:00
42919       2022.1.1 0:00
Name: Unnamed: 0, Length: 42920, dtype: object

In [28]:
df['Unnamed: 0'] = pd.to_datetime(df['Unnamed: 0'], format='%Y-%m-%d %H:%M:%S', errors='raise')

In [29]:
dates = pd.date_range('2017-01-01','2021-12-31',freq='H')

In [30]:
df.set_index('Unnamed: 0', drop=True, inplace=True)

In [31]:
df.head()

                       0
Unnamed: 0
2017-01-01 00:00:00  268
2017-01-01 01:00:00  192
2017-01-01 02:00:00  132
2017-01-01 03:00:00   89
2017-01-01 04:00:00  176

In [32]:
df_total = pd.DataFrame(index=dates, columns=['tide'])
df_total = pd.merge(df_total, df, left_index=True, right_index=True, how='left')

In [33]:
df_total = df_total[['0']]
df_total.rename(columns={'0': 'tide'}, inplace=True)
df_total.head()

                      tide
2017-01-01 00:00:00  268.0
2017-01-01 01:00:00  192.0
2017-01-01 02:00:00  132.0
2017-01-01 03:00:00   89.0
2017-01-01 04:00:00  176.0

In [34]:
df_dam = pd.read_csv('/Users/jkky/Documents/4_2_semester/기계학습기초/기말프로젝트/dam.csv')

In [35]:
df_dam['date'] = pd.to_datetime(df_dam['date'], format='%Y-%m-%d %H:%M:%S', errors='raise')

In [36]:
df_dam.set_index('date', drop=True, inplace=True)
df_dam

                        wl   iqty  rain  tdqty
date
2017-01-01 01:00:00  25.22  152.3   0.0   92.0
2017-01-01 02:00:00  25.22  134.6   0.0   88.0
2017-01-01 03:00:00  25.23  161.2   0.0   92.0
2017-01-01 04:00:00  25.22   63.2   0.0   88.0
2017-01-01 05:00:00  25.23  132.5   0.0   92.0
...                    ...    ...   ...    ...
2021-12-31 20:00:00  24.93  126.9   0.0  126.2
2021-12-31 21:00:00  24.92  126.8   0.0  126.7
2021-12-31 22:00:00  24.90  126.3   0.0  127.1
2021-12-31 23:00:00  24.92  127.5   0.0  127.7
2022-01-01 00:00:00  24.90  125.4   0.0  127.1

[43715 rows x 4 columns]

In [37]:
df_total = pd.merge(df_total, df_dam, left_index=True, right_index=True, how='left')

In [38]:
df_total.rename(columns={'wl':'water_level', 'iqty':'w_inflow', 'tdqty' : 'total_out'})

                      tide  water_level  w_inflow  rain  total_out
2017-01-01 00:00:00  268.0          NaN       NaN   NaN        NaN
2017-01-01 01:00:00  192.0        25.22     152.3   0.0       92.0
2017-01-01 02:00:00  132.0        25.22     134.6   0.0       88.0
2017-01-01 03:00:00   89.0        25.23     161.2   0.0       92.0
2017-01-01 04:00:00  176.0        25.22      63.2   0.0       88.0
...                    ...          ...       ...   ...        ...
2021-12-30 20:00:00  203.0        24.93     124.5   0.0      125.8
2021-12-30 21:00:00  142.0        24.94     124.8   0.0      125.5
2021-12-30 22:00:00   92.0        24.93     125.7   0.0      125.8
2021-12-30 23:00:00  124.0        24.93       0.0   0.0      125.9
2021-12-31 00:00:00  200.0        24.92     122.2   0.0      123.2

[43801 rows x 5 columns]

In [15]:
# df_total.isna().sum()

tide     905
wl       110
iqty     187
rain     110
tdqty    110
dtype: int64

In [19]:
# df_ex = df_total.interpolate()
# df_ex = df_total.fillna(0)
# df_ex.isna().sum()

tide     0
wl       1
iqty     1
rain     1
tdqty    1
dtype: int64

In [20]:
# df_ex.head()

                      tide     wl   iqty  rain  tdqty
2017-01-01 00:00:00  268.0    NaN    NaN   NaN    NaN
2017-01-01 01:00:00  192.0  25.22  152.3   0.0   92.0
2017-01-01 02:00:00  132.0  25.22  134.6   0.0   88.0
2017-01-01 03:00:00   89.0  25.23  161.2   0.0   92.0
2017-01-01 04:00:00  176.0  25.22   63.2   0.0   88.0